#include <stdio.h>
#include <string.h>
int main()
{
    char GB[40][3]={"¾©","½ò","»¦","Óå","¼½","Ô¥","ÔÆ","ÁÉ","ºÚ","Ïæ","Íî","Â³","ÐÂ","ËÕ",
	"Õã","¸Ó","¶õ","¹ð","¸Ê","½ú","ÃÉ","ÉÂ","¼ª","Ãö","¹ó","ÔÁ","Çà","²Ø",
	"´¨","Äþ","Çí","¹Ò","Ñ§","¾¯","¸Û","°Ä","Ì¨","Ê¹","Áì"} ;

    char UTF[40][16] = { "E4BAAC","E6B4A5","E6B2AA","E6B89D","E58680","E8B1AB","E4BA91",
"E8BEBD","E9BB91","E6B998","E79A96","E9B281","E696B0","E88B8F",
"E6B599","E8B5A3","E98482","E6A182","E79498","E6998B","E89299",
"E99995","E59089","E997BD","E8B4B5","E7B2A4","E99D92","E8978F",
"E5B79D","E5AE81","E790BC","E68C82","E5ADA6","E8ADA6","E6B8AF",
"E6BEB3","E58FB0","E4BDBF","E9A286" };
    char a[40] = { 0 };
    int i = 0;
    int j = 0;
    char b[40][10] = { 0 };
    printf("ÇëÊäÈë³µÅÆºÅ£º ") ;
    scanf("%s", a);
    for (i = 0; i < 20; i++) {
      if (a[i] < 0){
            b[j][0] = a[i];
            b[j][1] = a[i + 1];
            i++;
            j++;
        }
      else if (a[i] >= 0) {
            b[j][0]= a[i];
            j++;
            }
    }
   for (j = 0; j < 10; j++) {

        for (i = 0; i <= 40; i++) {
        	
            if (strcmp(b[j], GB[i]) == 0) {
            
                printf("%s",UTF[i]);
                break;

            }
            if (i ==39 ) {
            	
                printf("%s",b[j]);
            }
        }
    }
	return 0;
}
